"use strict";

/*
Необходимо реализовать четыре функции, каждая функция должна принимать по два
числа и выполнять одну из операций (каждая функция выполняет одну из них):
1. Сложение
2. Разность
3. Умножение
4. Деление
Необходимо сделать так, чтобы функция вернула число, например выражение
console.log(sum(2, 6)); должно вывести число 8 в консоль (sum - функция
сложения в данном примере, ваши названия функций могут отличаться).
Округлять значения, которые возвращают функции не нужно, однако, обратите
внимание на разность, функция должна вычесть из большего числа меньшее, либо
вернуть 0, если числа равны.
Функциям всегда передаются корректные числа, проверки на NaN, Infinity делать
не нужно.
Демонстрировать работы функций не обязательно.
*/

const rand = (num) => Math.floor(Math.random() * num);

const a = rand(10);
const b = rand(10);

console.log(a, b);

sum(a, b);
diff(a, b);
div(a, b);
multi(a, b);

function sum(a, b) {
  console.log(`Сумма чисел ${a} и ${b} равна ${a + b}.`);
}

function diff(a, b) {
  a > b
    ? console.log(`Разность чисел ${a} и ${b} равна ${a - b}.`)
    : console.log(`Разность чисел ${b} и ${a} равна ${b - a}.`);
}

function div(a, b) {
  console.log(`Частное чисел ${a} и ${b} равна ${a / b}.`);
}

function multi(a, b) {
  console.log(`Произведение чисел ${a} и ${b} равна ${a * b}.`);
}
